Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: དེ འི་ ཡང་ འདབ་ཆགས་ [113a] ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྙན་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $927 Situated beyond that [113.a] universe was a universe known as Melodious .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ པད་མ་ མཆོག་ གི་ འོད་ཟེར་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Light Rays of the Supreme Lotus.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ གྲགས་པ་ ལྡན་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Renowned .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ལྷུན་པོ ས་ བྱིན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Merudatta.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ བཤེས་གཉེན་ གྲགས་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Renowned Friend.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སེང་ གེ་ ལྟར་ གནོན་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Lion-like Subjugator.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སཱ་ལ འི་ དབང་པོ འི་ ཏོག་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Crest of Royal Sal Trees.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྣང་བ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $931 Situated beyond that universe was a universe known as Illumination .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དོན་ཡོད་ གོམ་པ ས་ རྣམ་པར་ གནོན་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Amogha­pada­vikrāmin.

source: དེ་ལྟ ར་ བྱང་ཤར་ གྱི་ ཕྱོགས་མཚམས་ ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སྐྱེ་བ་ གཅིག་ གིས་ ཐོགས་པ་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ དག་ ལྷགས་ ཏེ་
en: $932 In this way there arrived from the northeast innumerably and unfathomably many bodhisattva great beings, all held back by just a single birth.

source: ལྷགས་ ནས་ ཀྱང་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ ཤཱཀྱ་ ཐུབ་པ འི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཞིང་ བསྐོར་བ་ བྱས་ ཏེ |#| རྣམ་པ་ དུ་མ ས་ མཆོད་ནས་
en: Upon their arrival they bowed their heads to the feet of the blessed thus-gone Śākyamuni, circumambulated him, and presented numerous offerings.

source: བཅོམ་ལྡན་འདས་ འབའ་ཞིག་ ལ་ ལྟ་ ཞིང་ ཕྱོགས་ གཅིག་ ཏུ་ འཁོད་ དོ །_།
en: While keeping their gaze upon the Blessed One, they each found their place in the gathering.

source: དེ འི་ ཚེ་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ གང་ ལྷ་ དང་ །_ ཀླུ་ དང་ །_ གནོད་སྦྱིན་ དང་ །_ མི་ འམ་ ཅི་ དང་ །_ ལྟོ་འཕྱེ་ ཆེན་པོ་ [113b] དང་ །_ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ མཐུ་ ཆེ་བ་ བསམ་ གྱིས་ མི་ ཁྱབ་ ཅིང་ དཔེ་མེད་པ འི་ གོ་ཆ་ བགོས་པ་ དག་ གིས་ མ་ ཁྱབ་པ འི་ བར་ ནི་ ཐ་ན་ ཁར་བ་ བཞག་པ་ ཙམ་ ཡང་ མེད་ དོ །_།
en: Now the world had become completely filled with gods, nāgas, yakṣas, kiṃnaras, mahoragas, [113.b] and bodhisattva great beings of immense and inconceivable powers, bearers of the incomparable armor. |#| There were so many that in the end there was not even room enough to place an extra staff.

source: དེ་དག་ ཐམས་ཅད་ ཀྱང་ གཅིག་ ལ་ གཅིག་ ཉམ་ང་བ་ མེད་ དེ །_
en: No one there felt intimidated by the others.

source: ཆོས་ མཉན་པ འི་ སྲེད་པ ས་ བཅོམ་ ལྡན་འདས་ ཀྱི་ ཞལ་ དུ་ ལྟ་བ་ ལྷུར་ལེན་ ཅིང་ འཁོད་ དོ །_།
en: Instead, everyone kept ardently gazing at the Blessed One, yearning to listen to the Dharma.

source: བྱང་ཆུབ་ སེམས་དཔའ་ འདུས་པ འི་ ལེའུ་ སྟེ་ ལྔ་པ འོ །།_།།
en: $933 This concludes the fifth chapter.

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཤཱཀྱ་ ཐུབ་པ ས་ བྱང་ཆུབ་ སེམས་དཔའ་ འདུས་པ་ ཆེན་པོ་ དེ་ མཁྱེན་ ནས །_ |#| གདན་ དེ་ ལ་ བཞུགས་ བཞིན་ དུ་ དཔའ་བ ར་ འགྲོ་བ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: $934 Aware of the great gathering of bodhisattvas, the blessed Śākyamuni now, while remaining on his seat, entered the absorption known as valiant progress .

source: དེ་ལས་ བཞེངས་ ནས་ རྡོ་རྗེ འི་ སྙིང་པོ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he entered the one known as the vajra essence .

source: དེ་ལས་ བཞེངས་ ནས་ དེས་པ འི་ ཚིག་ མེད་པ འི་ གནས་ ལ་ གནས་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as remaining within the abode without descriptions .

source: དེ་ ལས་ བཞེངས་ ནས་ བཀོད་པ་ གཅིག་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the single array .

source: དེ་ལས་ བཞེངས་ ནས་ སེང་གེ འི་ གདུགས་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the lion parasol .

source: དེ་ལས་ བཞེངས་ ནས་ སྒྲུབ་པ་ མཐའ་ཡས་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as limitless accomplishment .

source: དེ་ལས་ བཞེངས་ ནས་ སེང་གེ་ རྣམ་པར་ བསྒྱིངས་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the yawning lion .

source: དེ་ལས་ བཞེངས་ ནས་ འོད་ཟེར་ རྒྱལ་པོ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the king of light rays .

source: དེ་ལས་ བཞེངས་ ནས་ ས འི་ སྙིང་པོ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the essence of the earth .

source: དེ་ལས་ བཞེངས་ ནས་ མངོན་པར་ མ་ དམིགས་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as no observation .

source: དེ་ལས་ བཞེངས་ ནས་ སེང་གེ་ རྣམ་པར་ འཕྲུལ་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: When he had emerged from that absorption, he next entered the one known as the manifestation of the lion .

source: དེ་ལས་ བཞེངས་ ནས་ ཟླ་བ འི་ དཀྱིལ་ འཁོར་ རྒྱལ་པོ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the king of the sphere of the moon .

source: དེ་ལས་ བཞེངས་ ནས་ བཀོད་པ་ གཅིག་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the single array .

source: དེ་ལས་ བཞེངས་ ནས་ འོད་ཟེར་ དུ་མ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as numerous light rays .

source: དེ་ལས་ བཞེངས་ [114a] ནས་ རྒྱ་མཚོ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, [114.a] he next entered the one known as the ocean .

source: དེ་ལས་ བཞེངས་ ནས་ ཕྱག་རྒྱ་ ཐམས་ཅད་ སྒྲུབ་པ་ ཆོས་ ཀྱི་ དབྱིངས་ སུ་ ངེས་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as practicing all seals and ascertaining the sphere of reality .

source: དེ་ལས་ བཞེངས་ ནས་ སྨོན་ལམ་ དང་ དམིགས་པ་ མཐའ་ ཡ ས་ སྟོན་ པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the display of infinite aspirations and focal points .

source: དེ་ལས་ བཞེངས་ ནས་ ཆོས་ ཐམས་ཅད་ ཁྱུ་མཆོག་ ཏུ་ གྱུར་པ་ མཐའ་ཡས་པ་ སྒྲུབ་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the limitless accomplishment that is primary with respect to all phenomena .

source: དེ་ལས་ བཞེངས་ ནས་ དམིགས་པ་ གཅིག་པ་ སྒྲུབ་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as accomplishing the single focal point .

source: དེ་ལས་ བཞེངས་ ནས་ ཆོས་ ཐམས་ཅད་ ཀྱི་ གནས་ ལ་ གནས་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as remaining within the abode of all phenomena .

source: དེ་ལས་ བཞེངས་ ནས་ འོད་ཟེར་ མཐའ་ ཡ ས་ སངས་རྒྱས་ པད་མ་ མངོན་དུ་ འཕགས་པ་ སྒྲུབ་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the practice of the limitless light rays of noble lotus buddha .

source: དེ་ལས་ བཞེངས་ ནས་ ཆོས་ ཐམས་ཅད་ ཤིན་ཏུ་ བྱང་བ་ དྲི་མ་ མེད་པ འི་ ཕྱག་རྒྱ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the stainless seal of mastery with regard to all phenomena .

source: དེ་ལས་ བཞེངས་ ནས་ ཆོས་ ཐམས་ཅད་ ཀྱི་ རྒྱལ་པོ འི་ ཕྱག་རྒྱ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the royal seal of all phenomena .

source: དེ་ལས་ བཞེངས་ ནས་ ཁྱུ་མཆོག་ མཐའ་ ཡ ས་ ཀུན་ དུ་ སྟོན་པ འི་ སངས་རྒྱས་ རྣམ་པར་ འཕྲུལ་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as buddha emanations revealing the infinite leader .

source: དེ་ལས་ བཞེངས་ ནས་ སེམས་ཅན་ ཐམས་ཅད་ ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་པ འི་ གོ་ཆ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the armor of all sentient beings going beyond suffering .

source: དེ་ལས་ བཞེངས་ ནས་ ཆོས་ ཐམས་ཅད་ དེ་བཞིན་ གཤེགས་པ འི་ སྤྱོད་ཡུལ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as all phenomena as the sphere of the thus-gone ones’ engagement .

source: དེ་ལས་ བཞེངས་ ནས་ ཁྱུ་མཆོག་ ཏུ་ གྱུར་པ་ མཐའ་ཡས་པ་ ཀུན་ དུ་ སྟོན་པ འི་ སངས་རྒྱས་ རྣམ་པར་ འཕྲུལ་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as buddha emanations revealing the infinite leader .

source: དེ་ལས་ བཞེངས་ ནས་ དམིགས་པ་ ཐམས་ཅད་ སངས་རྒྱས་པ འི་ སྒྲུབ་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as bringing all objects into buddhahood .

source: དེ་ལས་ བཞེངས་ ནས་ འདས་པ་ དང་ །_ མ་འོངས་པ་ དང་ །_ ད་ལྟ ར་ བྱུང་བ་ ལ་མ་ ཆགས་པ ར་ ཆོས་ ཐམས་ཅད་ ངེས་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as ascertainment of all phenomena unhindered with regard to past, future, or present. [114.b]

source: དེ་ལས་ [114b] བཞེངས་ ནས་ ཆོས་ ཐམས་ཅད་ ཀྱི་ དབང་ཕྱུག་ གིས་ དབང་ སྒྱུར་བ འི་ སངས་རྒྱས་ ཁྱུ་མཆོག་ ཅེས་བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the buddha-leader’s mastery of all phenomena .

source: དེ་ལས་ བཞེངས་ ནས་ ཆོས་ ཐམས་ཅད་ ཡང་དག་ པར་ འདུ་བ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as truly compiling all dharmas .

source: དེ་ལས་ བཞེངས་ ནས་ བརྟན་ པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the stable one .

source: དེ་ལས་ བཞེངས་ ནས་ རབ་ཏུ་ འཕེལ་བ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as greatly increasing .

source: དེ་ལས་ བཞེངས་ ནས་ རབ་ཏུ་ མི་ གཡོས་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the immutable .

source: དེ་ལས་ བཞེངས་ ནས་ མི་ འཁྲུགས་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as unperturbed .

source: དེ་ལས་ བཞེངས་ ནས་ ཆོས་ ཐམས་ཅད་ ལ་ ལྟ་བ་ དང་ །_ རྣམ་པར་ ལྟ་བ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as viewing and regarding all phenomena .

source: དེ་ལས་ བཞེངས་ ནས་ ཀུན་ དུ་ སྣང་བ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as universal illumination .

source: དེ་ལས་ བཞེངས་ ནས་ མཉམ་པ ར་ རྣམ་པར་ ལྟ་བ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as seeing as the same .

source: དེ་ལས་ བཞེངས་ ནས་ ལྟ་བ་ དང་ རྣམ་པར་ ལྟ་བ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as viewing and regarding .

source: དེ་ལས་ བཞེངས་ ནས་ མི་ལྟ་བ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as not viewing .

source: དེ་ལས་ བཞེངས་ ནས་ ཆོས་ ཐམས་ཅད་ ཐོགས་པ་ མེད་པ་ དང་ལེན་པ་ མེད་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as unhinderedness and non-appropriation with respect to all phenomena .

source: དེ་ལས་ བཞེངས་ ནས་ དབང་པོ་ དང་ ལྡན་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as possessing the faculties .

source: དེ་ལས་ བཞེངས་ ནས་ མི་ཟད་ ལ་ ཟད་ མི་ ཤེས་པ ར་ ངེས་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as ascertaining the inexhaustible as inexhaustible .

source: དེ་ལས་ བཞེངས་ ནས་ དམིགས་པ་ མི་ཟད་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the inexhaustible focal point .

source: དེ་ལས་ བཞེངས་ ནས་ དམིགས་པ་ གཅིག་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the single focal point .

source: དེ་ ལས་ བཞེངས་ ནས་ བཀོད་པ་ ཆེན་པོ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the great array .

source: དེ་ལས་ བཞེངས་ ནས་ བཀོད་པ་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the infinite array .

source: དེ་ལས་ བཞེངས་ ནས་ བག་ཚ་བ་ མེད་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the undaunted. [115.a]

source: [115a] དེ་ལས་ བཞེངས་ ནས་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ དགེ་བ འི་ རྩ་བ་ ཡང་དག་ པར་ སྐུལ་བ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as invoking the roots of virtue of all sentient beings .

source: དེ་ལས་ བཞེངས་ ནས་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ དགེ་བ འི་ རྩ་བ་ མངོན་དུ་ བྱེད་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as actualizing the roots of virtue of all sentient beings .

source: དེ་ལས་ བཞེངས་ ནས་ ཆོས་ ཐམས་ཅད་ ཡོངས་སུ་ ཚོལ་བ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as pursuing all dharmas .

source: དེ་ལས་ བཞེངས་ ནས་ སྣང་བར་ བྱེད་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as illuminating .

source: དེ་ལས་ བཞེངས་ ནས་ ཆོས་ ཐམས་ཅད་ རྣམ་པར་ དག་པ འི་ སྤྱོད་ཡུལ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the pure experience of all phenomena .

source: དེ་ལས་ བཞེངས་ ནས་ ཆོས་ ཐམས་ཅད་ སྟོན་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as showing all phenomena .

source: དེ་ལས་ བཞེངས་ ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཐམས་ཅད་ ཀྱི་ སྣང་བ་ རྣམ་པར་ དག་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་ པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the pure light of all bodhisattvas .

source: དེ་ལས་ བཞེངས་ ནས་ དེ་ནས་ བཅོམ་ལྡན་འདས་ ཉན་ཐོས་ ཐམས་ཅད་ ཀྱི་ སྒྲིབ་པ་ མེད་པ འི་ མིག་ རྣམ་པར་ སྦྱོང་བ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as purifying the unobscured eyes of all the hearers .

source: དེ་ལས་ བཞེངས་ ནས་ འཁོར་ ཐམས་ཅད་ ཀྱི་ སྒྲིབ་པ་ མེད་པར་ རྣམ་པར་ དག་པ འི་ དགེ་བ འི་ རྩ་བ་ ཡང་དག་ པར་ བསྐྱེད་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as producing pure roots of virtue in the entire retinue without obscuration .

source: དེ་ལས་ བཞེངས་ ནས་ དུད་འགྲོ འི་ སྐྱེ་གནས་ དང་ །_ གཤིན་རྗེ འི་ འཇིག་རྟེན་ གྱི་ སྡུག་བསྔལ་ རྒྱུན་ གཅོད་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as stopping the sufferings of the animal realm and the world of the Lord of Death .

source: དེ་ལས་ བཞེངས་ ནས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ ཐམས་ ཅད་ དུ་ བྱམས་པ་ ཆེན་པོ་ སྒྲུབ་པ ས་ དགེ་བ འི་ རྩ་བ་ ཡང་དག་ པར་ བསྐྱེད་པ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as producing roots of virtue by means of great love throughout all buddha realms .

source: དེ་ལས་ བཞེངས་ ནས་ མི་གཡོ་བ་ ཞེས་ བྱ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ སོ །_།
en: Emerging from that absorption, he next entered the one known as the immovable .

source: དེ་ལྟ ར་ བཅོམ་ལྡན་འདས་ མི་གཡོ་བ འི་ ཏིང་ངེ་འཛིན་ ལ་ སྙོམས་པ ར་ ཞུགས་ པ་ ན་ གནས་ གཙང་མ འི་ རིས་ ཀྱི་ ལྷ་ རྣམས་ ཀྱིས་ ཚིགས་ སུ་ བཅད་པ་ དག་ གིས་ མངོན་པར་ བསྟོད་པ །_།
en: Then, while the Blessed One was dwelling in the immovable absorption, the gods of the pure realms praised him in these verses:

source: མི་ གཡོ་ བརྙེས་པ ས་ གཡོ་མེད་ མི་གཡོ་བ །_།
en: $935 “Having discovered the immutable, you are beyond movement and fluctuation.

source: བསྙེན་ དཀའ་ ལྷུན་པོ་ འདྲ་བ་ རྣམ་པར་ མཛེས །_།
en: Forbidding, majestic mountain —how beautiful you are!

source: ཕས་ ཀྱི་ རྒོལ་བ་ ཐམས་ཅད་ ཟིལ་ མནན་ ནས །_། |#| སྟོང་གསུམ་ འཇིག་རྟེན་ ཤིན་ཏུ་ [115b] བླངས་ ཏེ་ བཞུགས །_།
en: Having subdued all hostile attacks You accept the billionfold universe. [115.b]

source: སངས་རྒྱས་ ཐུགས་ ནི་ ནམ་ཡང་ རྟེན་ མ་ མཆིས །_།
en: $936 “The mind of a buddha never takes any support.

source: མི་ རྟེན་ བསམ་གཏན་ མཛད་པ་ གང་ཟག་ མཆོག _།
en: Supreme is the person who practices concentration without support.

source: མིང་ཙམ་ བསམ་གཏན་པ་ སྟེ་ གར་ མི་ གནས །_།
en: ‘Being concentrated’ is just a name, for there is no remaining in anything.

source: སངས་རྒྱས་ ཡོན་ཏན་ དེ་ འདྲ་ བསམ་ མི་ ཁྱབ །_།
en: Such are the inconceivable qualities of the buddhas.

source: ཐུབ་པ་ ཁམས་ གསུམ་ ངེས་འབྱུང་ རིགས་གསུམ་ ལྡན །_།
en: $937 “The sages escape the three realms and possess the three classes.#35

source: རྟག་ ཏུ་ མཉམ་བཞག་ སོམ་ཉི་ མི་ མངའ་ བརྙེས །_།
en: Constantly in equipoise, they have no qualms.

source: ཐེ་ཙོམ་ བཅད་ ཅིང་ སོམ་ཉི་ བསལ་ དུ་ གསོལ །_།
en: Please sever all doubts and dispel all qualms.

source: སྲོག་ཆགས་ རྣམས་ ལ་སྨན་ སླད་ ཆོས་ བསྟན་ གསོལ །_།
en: Please teach the Dharma for the good of all beings.

source: ཐུབ་པ་ རབ་གནས་ སོམ་ཉི་ མི་ མངའ་ བརྙེས །_།
en: $938 “The sage is resting, free from all qualms.

source: བྱང་ཆུབ་ སེམས་དཔའ་ འདུས་པ་ དེ་དག་ ནི །_། དཔའ་བོ་ ཆོས་ ཀྱིས་ འཕགས་ ཤིང་ ཆོས་ ལ་ གནས །_།
en: The bodhisattvas gathered here Are heroes, masters of the Dharma who abide within it.

source: སོམ་ཉི་ བཅད་ ཅིང་ ཐེ་ཙོམ་ བསལ་ དུ་ གསོལ །_།
en: We request that you cut through qualms and dispel all doubts.

source: སངས་རྒྱས་ མིག་ བརྟེན་ བསམ་གཏན་ མཛད་ མ་ ལགས །_།
en: $939 “Buddhas do not practice concentration with the support of the eye;

source: སངས་རྒྱས་ མིག་ མ་ བརྟེན་པ ར་ སྒོམ་ མ་ ལགས །_།
en: Buddhas practice without the eye’s support.

source: རྟེན་ དང་ རྟེན་ མིན་ མིག་ ཀྱང་ མཆིས་ མ་ ལགས །_།
en: Support, no support, and eye—none of these apply.

source: བསམ་གཏན་ དེ་ ནི་ འཕགས་པ ས་ མངོན་པར་ བསྔགས །_།
en: Such is the concentration that is praised by noble beings.

source: ཐུབ་པ་ གལ་ཏེ་ མིག་ བརྟེན་ བསམ་གཏན་ མཛད །_།
en: $940 “If the sages practiced concentration with the support of the eye

source: རྒྱལ་བས་ འཛེམ་པ་ མ་ མཆིས་ བརྙེས་པ ར་ འགྱུར །_།
en: The victorious ones would not be pleased.

source: འདིར་ ནི་ མིག་ མེད་ བསམ་གཏན་ མཛད་པ་ ན །_།
en: When here concentration is practiced without the eye

source: སངས་རྒྱས་ མ་ མཆིས་ བརྟེན་ ནས་ |#| སྒོམ་ མ་ ལགས །_།
en: There is no buddha and no supported meditation.

source: སངས་རྒྱས་ དབང་པོ་ དྲུག་ བརྟེན་ སྒོམ་ མ་ ལགས །_།
en: $941 “Buddhas do not practice with the support of the six faculties;

source: རྒྱལ་བ་ དབང་པོ་ མ་ མཆིས་ བརྟེན་ མ་ ལགས །_།
en: Victorious ones do not have faculties and are not supported.

source: འདི་ ལ་ མུ་སྟེགས་ གཞན་ མང་ དེ་དག་ འཁྲུལ །_།
en: About this point the extremists and many others remain in delusion.

source: ལྷ ར་ བཅས་ འཇིག་རྟེན་ འགྲོ་བ་ རྟོགས་ མ་ ལགས །_།
en: The world of the wanderers, including the gods, all fail to realize this.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ མི་གཡོ་བ འི་ ཏིང་ངེ་འཛིན་ ལས་ བཞེངས་ ནས་ བྱང་ཆུབ་ སེམས་དཔ འི་ ཚོགས་ ལ་ རྗེས་སུ་ རྣམ་པར་ གཟིགས་ ཏེ
en: $942 Now the Blessed One emerged from the immovable absorption and looked upon the gathering of bodhisattvas. |#| Then

source: ཚེ་ དང་ ལྡན་པ་ ཤ་ར་དྭ་ཏི འི་ བུ་ ལ་ བཀའ་ སྩལ་པ །_
en: he said to the venerable Śāradvatī­putra,

source: ཤ་ར་དྭ་ཏི འི་ བུ་ཆོས་ བཞི་པོ་ འདི་དག་ ནི་ ཐེག་པ་ ཆེན་པོ་ ལ་ ཡང་དག་ པར་ ཞུགས་པ་ རྣམས་ ཀྱི་ ཡོངས་སུ་ ཉམས་པ ར་ མི་འགྱུར་བ་ དང་ །_ དགེ་བ འི་ རྩ་བ་ ཐམས་ཅད་ ཀྱི་ བསོད་ནམས་ ཀྱི་ ཚོགས་ དང་ །_ མངོན་པར་ མ་ དམིགས་པ འི་ སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ སྒྲུབ་ པ་ དང་ །_
en: “Śāradvatī­putra, for those who have entered the Great Vehicle, four qualities serve to protect from degeneration. |#| These four qualities likewise serve to gather the merit of all roots of virtue; |#| accomplish the wisdom of the buddhas beyond focal points;

source: སྦྱིན་པ འི་ སྟོབས་ སྒྲུབ་པ་ དང་ །_ ཚུལ་ཁྲིམས་ ཀྱི་ སྟོབས་ སྒྲུབ་པ་ དང་ །_ བཟོད་པ འི་ སྟོབས་ སྒྲུབ་པ་ དང་ །_ བྱམས་པ འི་ སྟོབས་ སྒྲུབ་པ་ དང་ །_ སྙིང་རྗེ འི་ སྟོབས་ སྒྲུབ་པ་ དང་ །_ ཏིང་ངེ་འཛིན་ གྱི་ སྟོབས་ སྒྲུབ་པ་ དང་ །_ ཤེས་རབ་ ཀྱི་ སྟོབས་ སྒྲུབ་པ་ དང་ །_
en: accomplish the power of generosity; |#| accomplish the power of discipline; |#| accomplish the power of patience; |#| accomplish the power of love; |#| accomplish the power of compassion; |#| accomplish the power of absorption; |#| accomplish the power of insight;

source: དེ་བཞིན་ གཤེགས་ [116a] པ འི་ སྟོབས་ བཅུ་ ཐོགས་པ་ མེད་པ་ སྒྲུབ་པ་ དང་ །_ ཤེས་རབ་ ཀྱི་ རབ་ཏུ་ དབྱེ་བ་ སྒྲུབ་པ་ དང་ །_ ཐོགས་པ་ མེད་པ འི་ སྤོབས་པ་ སྒྲུབ་པ་ དང་ །_ གཅད་ དུ་ མེད་པ་ དང་ །_ དགའ་བ་ དང་ །_ རྣོ་བ་ དང་ །_ ཟབ་པ འི་ སྤོབས་པ་ མཐའ་ཡས་པ་ སྒྲུབ་པ་ དང་ །_
en: [116.a] accomplish the ten powers of the thus-gone ones without impediment; |#| accomplish the discernment of insight; |#| accomplish unhindered eloquence; |#| accomplish the eloquence that is uninterrupted, joyous, sharp, and profound;

source: གཟུངས་ཐོབ་པ་ དང་ །_ སངས་རྒྱས་ མཐོང་བ་ ཐོབ་པ་ དང་ །_ མངོན་པར་ འབྱུང་བ་ ཐོབ་པ ར་ འགྱུར་ ཞིང་ ཇི་ལྟ ར་ འཚམ་པ འི་ དགེ་བ འི་ ཚོགས་ དང་ བྲལ་བ ར་ མི་ འགྱུར །_
en: attain retention; |#| attain vision of the buddhas; |#| attain renunciation without ever separating from the appropriate virtuous accumulations;

source: ལོངས་སྤྱོད་ མ་ཚང་བ་ མེད་པར་ འགྱུར །_
en: ensure that one’s enjoyments are not deficient;

source: གཡོག་འཁོར་ མ་ཚང་བ་ མེད་པར་ འགྱུར །_
en: ensure that one’s circle of helpers is not incomplete;

source: གཟུགས་ མ་ཚང་བ་ མེད་པར་ འགྱུར །_
en: ensure that one’s body is not deficient;

source: ཡན་ལག་ དང་ ཉིང་ལག་ མ་ཚང་ བ་ མེད་པར་ འགྱུར །_
en: ensure that the major and minor parts of one’s body are not incomplete;

source: མིག་ དང་ །_ རྣ་བ་ དང་ །_ སྣ་ དང་ །_ ལྕེ་ དང་ །_ ལུས་ མ་ཚང་བ་ མེད་པར་ འགྱུར །_
en: ensure that one’s eyes, nose, ears, tongue, and body are not deficient;

source: སེམས་མ་ ཚང་བ་ མེད་པར་ འགྱུར །_
en: ensure that one’s mind is not deficient;

source: ལམ་ངན་ པར་ ཞུགས་པ་ མ་ཡིན་པ ར་ འགྱུར །_
en: ensure that one does not take a bad path;

source: སེམས་ འཁྲུགས་པ་ མ་ཡིན་པ ར་ འགྱུར །_
en: ensure that one’s mind is not disturbed;

source: དྲན་པ་ རྨོངས་པ་ མ་ཡིན་པ ར་ འགྱུར །_
en: ensure that one’s mindfulness is not obscured;

source: དྲན་པ་ དང་ ལྡན་པ ར་ ཡང་ འགྱུར །_
en: ensure that one remains mindful;

source: དྲན་པ འི་ སྟོབས་ མཆོག་ དང་ ལྡན་པ ར་ འགྱུར །_
en: ensure that one possesses supreme mindfulness;

source: ངོ་ཚ་ ཤེས་པ་ དང་ ལྡན་ ཞིང་ ཁྲེལ་ཡོད་པ་ དང་ ལྡན་པ ར་ འགྱུར །_།
en: ensure that one is conscientious and decent;
